---
kind: property
id: P:Autodesk.Revit.DB.CylindricalHelix.Pitch
source: html/9c11bf63-8235-b2bc-2f6b-7ce8af45f847.htm
---
# Autodesk.Revit.DB.CylindricalHelix.Pitch Property

The pitch of the cylindrical helix.

## Syntax (C#)
```csharp
public double Pitch { get; }
```

## Remarks
It is the distance moved along the axis direction when a point makes one rotation about the axis.
 Pitch can be positive or negative.